//
// Created by SeongHeon Sim on 2023/04/24.
//
#include <bits/stdc++.h>

using namespace std;

const int V = 10;
bool matrix[V][V] = {
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
        {0, 0, 1, 1, 0, 0, 0, 0, 0, 0},
        {0, 1, 0, 0, 0, 0, 0, 0, 0, 0},
        {0, 1, 0, 0, 1, 0, 0, 0, 0, 0},
        {0, 0, 0, 1, 0, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0}
};

// 문제 1. 1-2, 1-3, 3-4 무방향 간선이 존재하는 인접 행렬을 표현해보자.
int main() {
    for (int i = 0; i < V; i++) {
        for (int j = 0; j < V; j++) {
            if (matrix[i][j]) {
                cout << i << "정점과 " << j << "정점 사이에 무방향 간선이 존재합니다.\n";
            }
        }
    }
}
